Example Case/system/FOs/ForcesMomentsWall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

	ForcesMomentsWall
	{
	type forces;
	libs          ("libforces.so");
	writeControl  adjustableRunTime;
	writeInterval   0.1;
	executeControl adjustableRunTime;
	executeInterval   0.1;

	patches       ("wall");
	rho           rhoInf;     // Indicates incompressible
	rhoInf        1;          // Redundant for incompressible
	CofR          (0 0 0);    // Rotation
	pitchAxis     (0 0 1);
	}

// ************************************************************************* //
