Example Case/system/SampleCrossSection
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location	system;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            surfaces;
interpolationScheme cellPoint;
libs            (sampling);
surfaceFormat	raw;

store           true;


fields          ("U" "vorticity");

surfaces
{
	crossSection
	{
	type            plane;
	planeType       pointAndNormal;
   	 pointAndNormalDict
    	{
        basePoint       (0 0 0);
        normal          (0 0 1);
    	}
	interpolate true;

	}
}

// ************************************************************************* //
