Example Case/system/mirrorMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mirrorMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeType           pointAndNormal;

pointAndNormalDict
{
    basePoint       (0 0 0); 
    normalVector (1 0 0); 
}

planeType           pointAndNormal;


planeTolerance      1e-3;