Example Case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    {
        name    allcells;
        type    cellSet;
        action  clear;
    }
    {
        name    allcells;
        type    cellSet;
        action  invert;
    }
    {
        name    all;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set allcells;
        }
    }
);